AllocationPointsTypeInfo[TypeId] Size: 1
<0x1169d98> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
TYCHE[0] = [18446744056529682432..17179869184] = FileName: ../../testcasesupport/io.c
	<0x1169d98> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
AllocationPointsTypeInfo[TypeId] Size: 1
<0x21a0988> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
TYCHE[0] = [18446744056529682432..17179869184] = FileName: CWE843_Type_Confusion__short_74_V2a.cpp
	<0x21a0988> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
AllocationPointsTypeInfo[TypeId] Size: 18
<0x24c3e90> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_key_compare<std::less<int> >", scope: <0x20f7a88>, file: <0x21b5268>, line: 142, size: 8, elements: <0x24c4e08>, templateParams: <0x24c40a8>, identifier: "_ZTSSt20_Rb_tree_key_compareISt4lessIiEE")
TYCHE[0] = [0..1] = FileName: CWE843_Type_Confusion__short_74_V2a.cpp
	<0x24029a0> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "map<int, void *, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x20f7a88>, file: <0x20f7a08>, line: 100, size: 384, elements: <0x201bf60>, templateParams: <0x21b51d0>, identifier: "_ZTSSt3mapIiPvSt4lessIiESaISt4pairIKiS0_EEE")
	<0x24c76d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_t", scope: <0x24029a0>, file: <0x20f7a08>, line: 151, baseType: <0x24e8858>, size: 384)

	<0x24af3c8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_impl", scope: <0x21ab280>, file: <0x21b5268>, line: 713, baseType: <0x21b5530>, size: 384, flags: DIFlagProtected)
	<0x21b5530> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_impl<std::less<int>, false>", scope: <0x21ab280>, file: <0x21b5268>, line: 681, size: 384, elements: <0x24af570>, templateParams: <0x21a55b0>, identifier: "_ZTSNSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE13_Rb_tree_implIS7_Lb0EEE")
	<0x24accb8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x21b5530>, baseType: <0x24c4060>, offset: 64)
	<0x24c4060> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_header", scope: <0x20f7a88>, file: <0x21b5268>, line: 168, size: 320, elements: <0x24acee8>, identifier: "_ZTSSt15_Rb_tree_header")
	<0x24ac8d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_header", scope: <0x24c4060>, file: <0x21b5268>, line: 170, baseType: <0x24c4e70>, size: 256)
	<0x24c4060> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_header", scope: <0x20f7a88>, file: <0x21b5268>, line: 168, size: 320, elements: <0x24acee8>, identifier: "_ZTSSt15_Rb_tree_header")
<0x212bbf8> = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
TYCHE[8] = [8..12] = FileName: CWE843_Type_Confusion__short_74_V2a.cpp
	<0x24029a0> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "map<int, void *, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x20f7a88>, file: <0x20f7a08>, line: 100, size: 384, elements: <0x201bf60>, templateParams: <0x21b51d0>, identifier: "_ZTSSt3mapIiPvSt4lessIiESaISt4pairIKiS0_EEE")
	<0x24c76d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_t", scope: <0x24029a0>, file: <0x20f7a08>, line: 151, baseType: <0x24e8858>, size: 384)
	<0x21ab280> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "_Rb_tree<int, std::pair<const int, void *>, std::_Select1st<std::pair<const int, void *> >, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x20f7a88>, file: <0x21b5268>, line: 444, size: 384, elements: <0x20f3a78>, templateParams: <0x2311dd8>, identifier: "_ZTSSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE")
	<0x24af3c8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_impl", scope: <0x21ab280>, file: <0x21b5268>, line: 713, baseType: <0x21b5530>, size: 384, flags: DIFlagProtected)
	<0x21b5530> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_impl<std::less<int>, false>", scope: <0x21ab280>, file: <0x21b5268>, line: 681, size: 384, elements: <0x24af570>, templateParams: <0x21a55b0>, identifier: "_ZTSNSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE13_Rb_tree_implIS7_Lb0EEE")
	<0x24accb8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x21b5530>, baseType: <0x24c4060>, offset: 64)
	<0x24c4060> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_header", scope: <0x20f7a88>, file: <0x21b5268>, line: 168, size: 320, elements: <0x24acee8>, identifier: "_ZTSSt15_Rb_tree_header")
	<0x24ac8d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_header", scope: <0x24c4060>, file: <0x21b5268>, line: 170, baseType: <0x24c4e70>, size: 256)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x24c51f8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_color", scope: <0x24c4e70>, file: <0x21b5268>, line: 106, baseType: <0x24c4ef0>, size: 32)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x24c5268> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x24c4e70>, size: 64)
TYCHE[16] = [16..24] = FileName: CWE843_Type_Confusion__short_74_V2a.cpp
	<0x24029a0> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "map<int, void *, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x20f7a88>, file: <0x20f7a08>, line: 100, size: 384, elements: <0x201bf60>, templateParams: <0x21b51d0>, identifier: "_ZTSSt3mapIiPvSt4lessIiESaISt4pairIKiS0_EEE")
	<0x24c76d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_t", scope: <0x24029a0>, file: <0x20f7a08>, line: 151, baseType: <0x24e8858>, size: 384)
	<0x21ab280> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "_Rb_tree<int, std::pair<const int, void *>, std::_Select1st<std::pair<const int, void *> >, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x20f7a88>, file: <0x21b5268>, line: 444, size: 384, elements: <0x20f3a78>, templateParams: <0x2311dd8>, identifier: "_ZTSSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE")
	<0x24af3c8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_impl", scope: <0x21ab280>, file: <0x21b5268>, line: 713, baseType: <0x21b5530>, size: 384, flags: DIFlagProtected)
	<0x21b5530> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_impl<std::less<int>, false>", scope: <0x21ab280>, file: <0x21b5268>, line: 681, size: 384, elements: <0x24af570>, templateParams: <0x21a55b0>, identifier: "_ZTSNSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE13_Rb_tree_implIS7_Lb0EEE")
	<0x24accb8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x21b5530>, baseType: <0x24c4060>, offset: 64)
	<0x24c4060> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_header", scope: <0x20f7a88>, file: <0x21b5268>, line: 168, size: 320, elements: <0x24acee8>, identifier: "_ZTSSt15_Rb_tree_header")
	<0x24ac8d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_header", scope: <0x24c4060>, file: <0x21b5268>, line: 170, baseType: <0x24c4e70>, size: 256)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x24c5348> = !DIDerivedType(tag: DW_TAG_member, name: "_M_parent", scope: <0x24c4e70>, file: <0x21b5268>, line: 107, baseType: <0x24c52d8>, size: 64, offset: 64)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x24c5268> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x24c4e70>, size: 64)
TYCHE[16] = [16..24] = FileName: CWE843_Type_Confusion__short_74_V2a.cpp
	<0x24029a0> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "map<int, void *, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x20f7a88>, file: <0x20f7a08>, line: 100, size: 384, elements: <0x201bf60>, templateParams: <0x21b51d0>, identifier: "_ZTSSt3mapIiPvSt4lessIiESaISt4pairIKiS0_EEE")
	<0x24c76d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_t", scope: <0x24029a0>, file: <0x20f7a08>, line: 151, baseType: <0x24e8858>, size: 384)
	<0x21ab280> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "_Rb_tree<int, std::pair<const int, void *>, std::_Select1st<std::pair<const int, void *> >, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x20f7a88>, file: <0x21b5268>, line: 444, size: 384, elements: <0x20f3a78>, templateParams: <0x2311dd8>, identifier: "_ZTSSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE")
	<0x24af3c8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_impl", scope: <0x21ab280>, file: <0x21b5268>, line: 713, baseType: <0x21b5530>, size: 384, flags: DIFlagProtected)
	<0x21b5530> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_impl<std::less<int>, false>", scope: <0x21ab280>, file: <0x21b5268>, line: 681, size: 384, elements: <0x24af570>, templateParams: <0x21a55b0>, identifier: "_ZTSNSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE13_Rb_tree_implIS7_Lb0EEE")
	<0x24accb8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x21b5530>, baseType: <0x24c4060>, offset: 64)
	<0x24c4060> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_header", scope: <0x20f7a88>, file: <0x21b5268>, line: 168, size: 320, elements: <0x24acee8>, identifier: "_ZTSSt15_Rb_tree_header")
	<0x24ac8d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_header", scope: <0x24c4060>, file: <0x21b5268>, line: 170, baseType: <0x24c4e70>, size: 256)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x24c5348> = !DIDerivedType(tag: DW_TAG_member, name: "_M_parent", scope: <0x24c4e70>, file: <0x21b5268>, line: 107, baseType: <0x24c52d8>, size: 64, offset: 64)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x24c5268> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x24c4e70>, size: 64)
TYCHE[24] = [24..32] = FileName: CWE843_Type_Confusion__short_74_V2a.cpp
	<0x24029a0> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "map<int, void *, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x20f7a88>, file: <0x20f7a08>, line: 100, size: 384, elements: <0x201bf60>, templateParams: <0x21b51d0>, identifier: "_ZTSSt3mapIiPvSt4lessIiESaISt4pairIKiS0_EEE")
	<0x24c76d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_t", scope: <0x24029a0>, file: <0x20f7a08>, line: 151, baseType: <0x24e8858>, size: 384)
	<0x21ab280> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "_Rb_tree<int, std::pair<const int, void *>, std::_Select1st<std::pair<const int, void *> >, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x20f7a88>, file: <0x21b5268>, line: 444, size: 384, elements: <0x20f3a78>, templateParams: <0x2311dd8>, identifier: "_ZTSSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE")
	<0x24af3c8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_impl", scope: <0x21ab280>, file: <0x21b5268>, line: 713, baseType: <0x21b5530>, size: 384, flags: DIFlagProtected)
	<0x21b5530> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_impl<std::less<int>, false>", scope: <0x21ab280>, file: <0x21b5268>, line: 681, size: 384, elements: <0x24af570>, templateParams: <0x21a55b0>, identifier: "_ZTSNSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE13_Rb_tree_implIS7_Lb0EEE")
	<0x24accb8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x21b5530>, baseType: <0x24c4060>, offset: 64)
	<0x24c4060> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_header", scope: <0x20f7a88>, file: <0x21b5268>, line: 168, size: 320, elements: <0x24acee8>, identifier: "_ZTSSt15_Rb_tree_header")
	<0x24ac8d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_header", scope: <0x24c4060>, file: <0x21b5268>, line: 170, baseType: <0x24c4e70>, size: 256)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x24c53b8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_left", scope: <0x24c4e70>, file: <0x21b5268>, line: 108, baseType: <0x24c52d8>, size: 64, offset: 128)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x24c5268> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x24c4e70>, size: 64)
TYCHE[24] = [24..32] = FileName: CWE843_Type_Confusion__short_74_V2a.cpp
	<0x24029a0> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "map<int, void *, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x20f7a88>, file: <0x20f7a08>, line: 100, size: 384, elements: <0x201bf60>, templateParams: <0x21b51d0>, identifier: "_ZTSSt3mapIiPvSt4lessIiESaISt4pairIKiS0_EEE")
	<0x24c76d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_t", scope: <0x24029a0>, file: <0x20f7a08>, line: 151, baseType: <0x24e8858>, size: 384)
	<0x21ab280> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "_Rb_tree<int, std::pair<const int, void *>, std::_Select1st<std::pair<const int, void *> >, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x20f7a88>, file: <0x21b5268>, line: 444, size: 384, elements: <0x20f3a78>, templateParams: <0x2311dd8>, identifier: "_ZTSSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE")
	<0x24af3c8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_impl", scope: <0x21ab280>, file: <0x21b5268>, line: 713, baseType: <0x21b5530>, size: 384, flags: DIFlagProtected)
	<0x21b5530> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_impl<std::less<int>, false>", scope: <0x21ab280>, file: <0x21b5268>, line: 681, size: 384, elements: <0x24af570>, templateParams: <0x21a55b0>, identifier: "_ZTSNSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE13_Rb_tree_implIS7_Lb0EEE")
	<0x24accb8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x21b5530>, baseType: <0x24c4060>, offset: 64)
	<0x24c4060> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_header", scope: <0x20f7a88>, file: <0x21b5268>, line: 168, size: 320, elements: <0x24acee8>, identifier: "_ZTSSt15_Rb_tree_header")
	<0x24ac8d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_header", scope: <0x24c4060>, file: <0x21b5268>, line: 170, baseType: <0x24c4e70>, size: 256)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x24c53b8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_left", scope: <0x24c4e70>, file: <0x21b5268>, line: 108, baseType: <0x24c52d8>, size: 64, offset: 128)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x24c5268> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x24c4e70>, size: 64)
TYCHE[32] = [32..40] = FileName: CWE843_Type_Confusion__short_74_V2a.cpp
	<0x24029a0> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "map<int, void *, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x20f7a88>, file: <0x20f7a08>, line: 100, size: 384, elements: <0x201bf60>, templateParams: <0x21b51d0>, identifier: "_ZTSSt3mapIiPvSt4lessIiESaISt4pairIKiS0_EEE")
	<0x24c76d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_t", scope: <0x24029a0>, file: <0x20f7a08>, line: 151, baseType: <0x24e8858>, size: 384)
	<0x21ab280> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "_Rb_tree<int, std::pair<const int, void *>, std::_Select1st<std::pair<const int, void *> >, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x20f7a88>, file: <0x21b5268>, line: 444, size: 384, elements: <0x20f3a78>, templateParams: <0x2311dd8>, identifier: "_ZTSSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE")
	<0x24af3c8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_impl", scope: <0x21ab280>, file: <0x21b5268>, line: 713, baseType: <0x21b5530>, size: 384, flags: DIFlagProtected)
	<0x21b5530> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_impl<std::less<int>, false>", scope: <0x21ab280>, file: <0x21b5268>, line: 681, size: 384, elements: <0x24af570>, templateParams: <0x21a55b0>, identifier: "_ZTSNSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE13_Rb_tree_implIS7_Lb0EEE")
	<0x24accb8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x21b5530>, baseType: <0x24c4060>, offset: 64)
	<0x24c4060> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_header", scope: <0x20f7a88>, file: <0x21b5268>, line: 168, size: 320, elements: <0x24acee8>, identifier: "_ZTSSt15_Rb_tree_header")
	<0x24ac8d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_header", scope: <0x24c4060>, file: <0x21b5268>, line: 170, baseType: <0x24c4e70>, size: 256)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x24ac358> = !DIDerivedType(tag: DW_TAG_member, name: "_M_right", scope: <0x24c4e70>, file: <0x21b5268>, line: 109, baseType: <0x24c52d8>, size: 64, offset: 192)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x24c5268> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x24c4e70>, size: 64)
TYCHE[32] = [32..40] = FileName: CWE843_Type_Confusion__short_74_V2a.cpp
	<0x24029a0> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "map<int, void *, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x20f7a88>, file: <0x20f7a08>, line: 100, size: 384, elements: <0x201bf60>, templateParams: <0x21b51d0>, identifier: "_ZTSSt3mapIiPvSt4lessIiESaISt4pairIKiS0_EEE")
	<0x24c76d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_t", scope: <0x24029a0>, file: <0x20f7a08>, line: 151, baseType: <0x24e8858>, size: 384)
	<0x21ab280> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "_Rb_tree<int, std::pair<const int, void *>, std::_Select1st<std::pair<const int, void *> >, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x20f7a88>, file: <0x21b5268>, line: 444, size: 384, elements: <0x20f3a78>, templateParams: <0x2311dd8>, identifier: "_ZTSSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE")
	<0x24af3c8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_impl", scope: <0x21ab280>, file: <0x21b5268>, line: 713, baseType: <0x21b5530>, size: 384, flags: DIFlagProtected)
	<0x21b5530> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_impl<std::less<int>, false>", scope: <0x21ab280>, file: <0x21b5268>, line: 681, size: 384, elements: <0x24af570>, templateParams: <0x21a55b0>, identifier: "_ZTSNSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE13_Rb_tree_implIS7_Lb0EEE")
	<0x24accb8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x21b5530>, baseType: <0x24c4060>, offset: 64)
	<0x24c4060> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_header", scope: <0x20f7a88>, file: <0x21b5268>, line: 168, size: 320, elements: <0x24acee8>, identifier: "_ZTSSt15_Rb_tree_header")
	<0x24ac8d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_header", scope: <0x24c4060>, file: <0x21b5268>, line: 170, baseType: <0x24c4e70>, size: 256)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x24ac358> = !DIDerivedType(tag: DW_TAG_member, name: "_M_right", scope: <0x24c4e70>, file: <0x21b5268>, line: 109, baseType: <0x24c52d8>, size: 64, offset: 192)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x21ad2b8> = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
TYCHE[40] = [40..48] = FileName: CWE843_Type_Confusion__short_74_V2a.cpp
	<0x24029a0> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "map<int, void *, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x20f7a88>, file: <0x20f7a08>, line: 100, size: 384, elements: <0x201bf60>, templateParams: <0x21b51d0>, identifier: "_ZTSSt3mapIiPvSt4lessIiESaISt4pairIKiS0_EEE")
	<0x24c76d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_t", scope: <0x24029a0>, file: <0x20f7a08>, line: 151, baseType: <0x24e8858>, size: 384)
	<0x21ab280> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "_Rb_tree<int, std::pair<const int, void *>, std::_Select1st<std::pair<const int, void *> >, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x20f7a88>, file: <0x21b5268>, line: 444, size: 384, elements: <0x20f3a78>, templateParams: <0x2311dd8>, identifier: "_ZTSSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE")
	<0x24af3c8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_impl", scope: <0x21ab280>, file: <0x21b5268>, line: 713, baseType: <0x21b5530>, size: 384, flags: DIFlagProtected)
	<0x21b5530> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_impl<std::less<int>, false>", scope: <0x21ab280>, file: <0x21b5268>, line: 681, size: 384, elements: <0x24af570>, templateParams: <0x21a55b0>, identifier: "_ZTSNSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE13_Rb_tree_implIS7_Lb0EEE")
	<0x24accb8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x21b5530>, baseType: <0x24c4060>, offset: 64)
	<0x24c4060> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_header", scope: <0x20f7a88>, file: <0x21b5268>, line: 168, size: 320, elements: <0x24acee8>, identifier: "_ZTSSt15_Rb_tree_header")
	<0x24ac948> = !DIDerivedType(tag: DW_TAG_member, name: "_M_node_count", scope: <0x24c4060>, file: <0x21b5268>, line: 171, baseType: <0x21521e8>, size: 64, offset: 256)
	<0x24c4060> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_header", scope: <0x20f7a88>, file: <0x21b5268>, line: 168, size: 320, elements: <0x24acee8>, identifier: "_ZTSSt15_Rb_tree_header")
CWE843_Type_Confusion__short_74_V2a.cpp#33_34##140454888013840#140735505758368
AllocationPointsDIInfo[39665752] Size: 19
--------------------------------------------------------------------------------------------------------------
AllocationPointsTypeInfo[TypeId] Size: 14
<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
TYCHE[0] = [0..32] = FileName: CWE843_Type_Confusion__short_74_V2a.cpp
	<0x2518a40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x20f7a88>, file: <0x21b5268>, line: 216, size: 384, elements: <0x251bd40>, templateParams: <0x25165d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x2516698> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x2518a40>, baseType: <0x24c4e70>)
	<0x2518a40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x20f7a88>, file: <0x21b5268>, line: 216, size: 384, elements: <0x251bd40>, templateParams: <0x25165d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
<0x212bbf8> = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
TYCHE[0] = [0..4] = FileName: CWE843_Type_Confusion__short_74_V2a.cpp
	<0x2518a40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x20f7a88>, file: <0x21b5268>, line: 216, size: 384, elements: <0x251bd40>, templateParams: <0x25165d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x2516698> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x2518a40>, baseType: <0x24c4e70>)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x24c51f8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_color", scope: <0x24c4e70>, file: <0x21b5268>, line: 106, baseType: <0x24c4ef0>, size: 32)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x2518a40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x20f7a88>, file: <0x21b5268>, line: 216, size: 384, elements: <0x251bd40>, templateParams: <0x25165d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
TYCHE[0] = [18446744056529682432..17179869184] = FileName: CWE843_Type_Confusion__short_74_V2a.cpp
	<0x2518a40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x20f7a88>, file: <0x21b5268>, line: 216, size: 384, elements: <0x251bd40>, templateParams: <0x25165d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
<0x24c5268> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x24c4e70>, size: 64)
TYCHE[8] = [8..16] = FileName: CWE843_Type_Confusion__short_74_V2a.cpp
	<0x2518a40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x20f7a88>, file: <0x21b5268>, line: 216, size: 384, elements: <0x251bd40>, templateParams: <0x25165d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x2516698> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x2518a40>, baseType: <0x24c4e70>)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x24c5348> = !DIDerivedType(tag: DW_TAG_member, name: "_M_parent", scope: <0x24c4e70>, file: <0x21b5268>, line: 107, baseType: <0x24c52d8>, size: 64, offset: 64)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x24c5268> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x24c4e70>, size: 64)
TYCHE[8] = [8..16] = FileName: CWE843_Type_Confusion__short_74_V2a.cpp
	<0x2518a40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x20f7a88>, file: <0x21b5268>, line: 216, size: 384, elements: <0x251bd40>, templateParams: <0x25165d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x2516698> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x2518a40>, baseType: <0x24c4e70>)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x24c5348> = !DIDerivedType(tag: DW_TAG_member, name: "_M_parent", scope: <0x24c4e70>, file: <0x21b5268>, line: 107, baseType: <0x24c52d8>, size: 64, offset: 64)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x24c5268> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x24c4e70>, size: 64)
TYCHE[16] = [16..24] = FileName: CWE843_Type_Confusion__short_74_V2a.cpp
	<0x2518a40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x20f7a88>, file: <0x21b5268>, line: 216, size: 384, elements: <0x251bd40>, templateParams: <0x25165d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x2516698> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x2518a40>, baseType: <0x24c4e70>)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x24c53b8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_left", scope: <0x24c4e70>, file: <0x21b5268>, line: 108, baseType: <0x24c52d8>, size: 64, offset: 128)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x24c5268> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x24c4e70>, size: 64)
TYCHE[16] = [16..24] = FileName: CWE843_Type_Confusion__short_74_V2a.cpp
	<0x2518a40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x20f7a88>, file: <0x21b5268>, line: 216, size: 384, elements: <0x251bd40>, templateParams: <0x25165d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x2516698> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x2518a40>, baseType: <0x24c4e70>)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x24c53b8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_left", scope: <0x24c4e70>, file: <0x21b5268>, line: 108, baseType: <0x24c52d8>, size: 64, offset: 128)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x24c5268> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x24c4e70>, size: 64)
TYCHE[24] = [24..32] = FileName: CWE843_Type_Confusion__short_74_V2a.cpp
	<0x2518a40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x20f7a88>, file: <0x21b5268>, line: 216, size: 384, elements: <0x251bd40>, templateParams: <0x25165d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x2516698> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x2518a40>, baseType: <0x24c4e70>)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x24ac358> = !DIDerivedType(tag: DW_TAG_member, name: "_M_right", scope: <0x24c4e70>, file: <0x21b5268>, line: 109, baseType: <0x24c52d8>, size: 64, offset: 192)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x24c5268> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x24c4e70>, size: 64)
TYCHE[24] = [24..32] = FileName: CWE843_Type_Confusion__short_74_V2a.cpp
	<0x2518a40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x20f7a88>, file: <0x21b5268>, line: 216, size: 384, elements: <0x251bd40>, templateParams: <0x25165d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x2516698> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x2518a40>, baseType: <0x24c4e70>)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x24ac358> = !DIDerivedType(tag: DW_TAG_member, name: "_M_right", scope: <0x24c4e70>, file: <0x21b5268>, line: 109, baseType: <0x24c52d8>, size: 64, offset: 192)
	<0x24c4e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x20f7a88>, file: <0x21b5268>, line: 101, size: 256, elements: <0x24ac890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x23109d0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x20f7a88>, file: <0x2310a28>, line: 208, size: 128, elements: <0x240dde8>, templateParams: <0x2315650>, identifier: "_ZTSSt4pairIKiPvE")
TYCHE[32] = [32..48] = FileName: CWE843_Type_Confusion__short_74_V2a.cpp
	<0x2518a40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x20f7a88>, file: <0x21b5268>, line: 216, size: 384, elements: <0x251bd40>, templateParams: <0x25165d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x2516708> = !DIDerivedType(tag: DW_TAG_member, name: "_M_value_field", scope: <0x2518a40>, file: <0x21b5268>, line: 221, baseType: <0x23109d0>, size: 128, offset: 256)
	<0x2518a40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x20f7a88>, file: <0x21b5268>, line: 216, size: 384, elements: <0x251bd40>, templateParams: <0x25165d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
<0x212bbf8> = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
TYCHE[32] = [32..36] = FileName: CWE843_Type_Confusion__short_74_V2a.cpp
	<0x2518a40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x20f7a88>, file: <0x21b5268>, line: 216, size: 384, elements: <0x251bd40>, templateParams: <0x25165d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x2516708> = !DIDerivedType(tag: DW_TAG_member, name: "_M_value_field", scope: <0x2518a40>, file: <0x21b5268>, line: 221, baseType: <0x23109d0>, size: 128, offset: 256)
	<0x23109d0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x20f7a88>, file: <0x2310a28>, line: 208, size: 128, elements: <0x240dde8>, templateParams: <0x2315650>, identifier: "_ZTSSt4pairIKiPvE")
	<0x240a208> = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: <0x23109d0>, file: <0x2310a28>, line: 214, baseType: <0x23cc3e8>, size: 32)
	<0x23109d0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x20f7a88>, file: <0x2310a28>, line: 208, size: 128, elements: <0x240dde8>, templateParams: <0x2315650>, identifier: "_ZTSSt4pairIKiPvE")
<0x2310a90> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "__pair_base<const int, void *>", scope: <0x20f7a88>, file: <0x2310a28>, line: 190, size: 8, elements: <0x20743f0>, templateParams: <0x240a1c0>, identifier: "_ZTSSt11__pair_baseIKiPvE")
TYCHE[32] = [32..33] = FileName: CWE843_Type_Confusion__short_74_V2a.cpp
	<0x2518a40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x20f7a88>, file: <0x21b5268>, line: 216, size: 384, elements: <0x251bd40>, templateParams: <0x25165d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x2516708> = !DIDerivedType(tag: DW_TAG_member, name: "_M_value_field", scope: <0x2518a40>, file: <0x21b5268>, line: 221, baseType: <0x23109d0>, size: 128, offset: 256)
	<0x23109d0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x20f7a88>, file: <0x2310a28>, line: 208, size: 128, elements: <0x240dde8>, templateParams: <0x2315650>, identifier: "_ZTSSt4pairIKiPvE")
	<0x240a858> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x23109d0>, baseType: <0x2310a90>, flags: DIFlagPrivate)
	<0x23109d0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x20f7a88>, file: <0x2310a28>, line: 208, size: 128, elements: <0x240dde8>, templateParams: <0x2315650>, identifier: "_ZTSSt4pairIKiPvE")
<0x203b828> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x21a0988>, size: 64)
TYCHE[40] = [40..48] = FileName: CWE843_Type_Confusion__short_74_V2a.cpp
	<0x2518a40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x20f7a88>, file: <0x21b5268>, line: 216, size: 384, elements: <0x251bd40>, templateParams: <0x25165d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x2516708> = !DIDerivedType(tag: DW_TAG_member, name: "_M_value_field", scope: <0x2518a40>, file: <0x21b5268>, line: 221, baseType: <0x23109d0>, size: 128, offset: 256)
	<0x23109d0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x20f7a88>, file: <0x2310a28>, line: 208, size: 128, elements: <0x240dde8>, templateParams: <0x2315650>, identifier: "_ZTSSt4pairIKiPvE")
	<0x240a278> = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: <0x23109d0>, file: <0x2310a28>, line: 215, baseType: <0x21a2188>, size: 64, offset: 64)
	<0x23109d0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x20f7a88>, file: <0x2310a28>, line: 208, size: 128, elements: <0x240dde8>, templateParams: <0x2315650>, identifier: "_ZTSSt4pairIKiPvE")
<0x203b828> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x21a0988>, size: 64)
TYCHE[40] = [40..48] = FileName: CWE843_Type_Confusion__short_74_V2a.cpp
	<0x2518a40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x20f7a88>, file: <0x21b5268>, line: 216, size: 384, elements: <0x251bd40>, templateParams: <0x25165d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x2516708> = !DIDerivedType(tag: DW_TAG_member, name: "_M_value_field", scope: <0x2518a40>, file: <0x21b5268>, line: 221, baseType: <0x23109d0>, size: 128, offset: 256)
	<0x23109d0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x20f7a88>, file: <0x2310a28>, line: 208, size: 128, elements: <0x240dde8>, templateParams: <0x2315650>, identifier: "_ZTSSt4pairIKiPvE")
	<0x240a278> = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: <0x23109d0>, file: <0x2310a28>, line: 215, baseType: <0x21a2188>, size: 64, offset: 64)
	<0x23109d0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x20f7a88>, file: <0x2310a28>, line: 208, size: 128, elements: <0x240dde8>, templateParams: <0x2315650>, identifier: "_ZTSSt4pairIKiPvE")
CWE843_Type_Confusion__short_74_V2a.cpp#111_27##140454888013840#140735505758368
AllocationPointsDIInfo[38699944] Size: 33
--------------------------------------------------------------------------------------------------------------
AllocationPointsTypeInfo[TypeId] Size: 1
<0x2698428> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
TYCHE[0] = [18446744056529682432..17179869184] = FileName: CWE843_Type_Confusion__short_74_V2b.cpp
	<0x2698428> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
AllocationPointsTypeInfo[TypeId] Size: 14
<0x29bca70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x25ef528>, file: <0x29acd58>, line: 101, size: 256, elements: <0x29bdb60>, identifier: "_ZTSSt18_Rb_tree_node_base")
TYCHE[0] = [0..32] = FileName: CWE843_Type_Confusion__short_74_V2b.cpp
	<0x2a1a6a0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x25ef528>, file: <0x29acd58>, line: 216, size: 384, elements: <0x2a1e880>, templateParams: <0x2a1ccd8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x2a1abf8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x2a1a6a0>, baseType: <0x29bca70>)
	<0x2a1a6a0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x25ef528>, file: <0x29acd58>, line: 216, size: 384, elements: <0x2a1e880>, templateParams: <0x2a1ccd8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
<0x2623698> = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
TYCHE[0] = [0..4] = FileName: CWE843_Type_Confusion__short_74_V2b.cpp
	<0x2a1a6a0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x25ef528>, file: <0x29acd58>, line: 216, size: 384, elements: <0x2a1e880>, templateParams: <0x2a1ccd8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x2a1abf8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x2a1a6a0>, baseType: <0x29bca70>)
	<0x29bca70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x25ef528>, file: <0x29acd58>, line: 101, size: 256, elements: <0x29bdb60>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x29bcbe8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_color", scope: <0x29bca70>, file: <0x29acd58>, line: 106, baseType: <0x29bcaf0>, size: 32)
	<0x29bca70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x25ef528>, file: <0x29acd58>, line: 101, size: 256, elements: <0x29bdb60>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x2a1a6a0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x25ef528>, file: <0x29acd58>, line: 216, size: 384, elements: <0x2a1e880>, templateParams: <0x2a1ccd8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
TYCHE[0] = [18446744056529682432..17179869184] = FileName: CWE843_Type_Confusion__short_74_V2b.cpp
	<0x2a1a6a0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x25ef528>, file: <0x29acd58>, line: 216, size: 384, elements: <0x2a1e880>, templateParams: <0x2a1ccd8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
<0x29bcc58> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x29bca70>, size: 64)
TYCHE[8] = [8..16] = FileName: CWE843_Type_Confusion__short_74_V2b.cpp
	<0x2a1a6a0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x25ef528>, file: <0x29acd58>, line: 216, size: 384, elements: <0x2a1e880>, templateParams: <0x2a1ccd8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x2a1abf8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x2a1a6a0>, baseType: <0x29bca70>)
	<0x29bca70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x25ef528>, file: <0x29acd58>, line: 101, size: 256, elements: <0x29bdb60>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x29bcd38> = !DIDerivedType(tag: DW_TAG_member, name: "_M_parent", scope: <0x29bca70>, file: <0x29acd58>, line: 107, baseType: <0x29bccc8>, size: 64, offset: 64)
	<0x29bca70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x25ef528>, file: <0x29acd58>, line: 101, size: 256, elements: <0x29bdb60>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x29bcc58> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x29bca70>, size: 64)
TYCHE[8] = [8..16] = FileName: CWE843_Type_Confusion__short_74_V2b.cpp
	<0x2a1a6a0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x25ef528>, file: <0x29acd58>, line: 216, size: 384, elements: <0x2a1e880>, templateParams: <0x2a1ccd8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x2a1abf8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x2a1a6a0>, baseType: <0x29bca70>)
	<0x29bca70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x25ef528>, file: <0x29acd58>, line: 101, size: 256, elements: <0x29bdb60>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x29bcd38> = !DIDerivedType(tag: DW_TAG_member, name: "_M_parent", scope: <0x29bca70>, file: <0x29acd58>, line: 107, baseType: <0x29bccc8>, size: 64, offset: 64)
	<0x29bca70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x25ef528>, file: <0x29acd58>, line: 101, size: 256, elements: <0x29bdb60>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x29bcc58> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x29bca70>, size: 64)
TYCHE[16] = [16..24] = FileName: CWE843_Type_Confusion__short_74_V2b.cpp
	<0x2a1a6a0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x25ef528>, file: <0x29acd58>, line: 216, size: 384, elements: <0x2a1e880>, templateParams: <0x2a1ccd8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x2a1abf8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x2a1a6a0>, baseType: <0x29bca70>)
	<0x29bca70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x25ef528>, file: <0x29acd58>, line: 101, size: 256, elements: <0x29bdb60>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x29bcda8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_left", scope: <0x29bca70>, file: <0x29acd58>, line: 108, baseType: <0x29bccc8>, size: 64, offset: 128)
	<0x29bca70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x25ef528>, file: <0x29acd58>, line: 101, size: 256, elements: <0x29bdb60>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x29bcc58> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x29bca70>, size: 64)
TYCHE[16] = [16..24] = FileName: CWE843_Type_Confusion__short_74_V2b.cpp
	<0x2a1a6a0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x25ef528>, file: <0x29acd58>, line: 216, size: 384, elements: <0x2a1e880>, templateParams: <0x2a1ccd8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x2a1abf8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x2a1a6a0>, baseType: <0x29bca70>)
	<0x29bca70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x25ef528>, file: <0x29acd58>, line: 101, size: 256, elements: <0x29bdb60>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x29bcda8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_left", scope: <0x29bca70>, file: <0x29acd58>, line: 108, baseType: <0x29bccc8>, size: 64, offset: 128)
	<0x29bca70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x25ef528>, file: <0x29acd58>, line: 101, size: 256, elements: <0x29bdb60>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x29bcc58> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x29bca70>, size: 64)
TYCHE[24] = [24..32] = FileName: CWE843_Type_Confusion__short_74_V2b.cpp
	<0x2a1a6a0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x25ef528>, file: <0x29acd58>, line: 216, size: 384, elements: <0x2a1e880>, templateParams: <0x2a1ccd8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x2a1abf8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x2a1a6a0>, baseType: <0x29bca70>)
	<0x29bca70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x25ef528>, file: <0x29acd58>, line: 101, size: 256, elements: <0x29bdb60>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x29bd628> = !DIDerivedType(tag: DW_TAG_member, name: "_M_right", scope: <0x29bca70>, file: <0x29acd58>, line: 109, baseType: <0x29bccc8>, size: 64, offset: 192)
	<0x29bca70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x25ef528>, file: <0x29acd58>, line: 101, size: 256, elements: <0x29bdb60>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x29bcc58> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x29bca70>, size: 64)
TYCHE[24] = [24..32] = FileName: CWE843_Type_Confusion__short_74_V2b.cpp
	<0x2a1a6a0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x25ef528>, file: <0x29acd58>, line: 216, size: 384, elements: <0x2a1e880>, templateParams: <0x2a1ccd8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x2a1abf8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x2a1a6a0>, baseType: <0x29bca70>)
	<0x29bca70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x25ef528>, file: <0x29acd58>, line: 101, size: 256, elements: <0x29bdb60>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x29bd628> = !DIDerivedType(tag: DW_TAG_member, name: "_M_right", scope: <0x29bca70>, file: <0x29acd58>, line: 109, baseType: <0x29bccc8>, size: 64, offset: 192)
	<0x29bca70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x25ef528>, file: <0x29acd58>, line: 101, size: 256, elements: <0x29bdb60>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x2a1a330> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x25ef528>, file: <0x28fa578>, line: 208, size: 128, elements: <0x2a19f88>, templateParams: <0x2a1a430>, identifier: "_ZTSSt4pairIKiPvE")
TYCHE[32] = [32..48] = FileName: CWE843_Type_Confusion__short_74_V2b.cpp
	<0x2a1a6a0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x25ef528>, file: <0x29acd58>, line: 216, size: 384, elements: <0x2a1e880>, templateParams: <0x2a1ccd8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x2a1cf38> = !DIDerivedType(tag: DW_TAG_member, name: "_M_value_field", scope: <0x2a1a6a0>, file: <0x29acd58>, line: 221, baseType: <0x2a1a330>, size: 128, offset: 256)
	<0x2a1a6a0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x25ef528>, file: <0x29acd58>, line: 216, size: 384, elements: <0x2a1e880>, templateParams: <0x2a1ccd8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
<0x2623698> = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
TYCHE[32] = [32..36] = FileName: CWE843_Type_Confusion__short_74_V2b.cpp
	<0x2a1a6a0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x25ef528>, file: <0x29acd58>, line: 216, size: 384, elements: <0x2a1e880>, templateParams: <0x2a1ccd8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x2a1cf38> = !DIDerivedType(tag: DW_TAG_member, name: "_M_value_field", scope: <0x2a1a6a0>, file: <0x29acd58>, line: 221, baseType: <0x2a1a330>, size: 128, offset: 256)
	<0x2a1a330> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x25ef528>, file: <0x28fa578>, line: 208, size: 128, elements: <0x2a19f88>, templateParams: <0x2a1a430>, identifier: "_ZTSSt4pairIKiPvE")
	<0x2a1a798> = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: <0x2a1a330>, file: <0x28fa578>, line: 214, baseType: <0x2649cf8>, size: 32)
	<0x2a1a330> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x25ef528>, file: <0x28fa578>, line: 208, size: 128, elements: <0x2a19f88>, templateParams: <0x2a1a430>, identifier: "_ZTSSt4pairIKiPvE")
<0x2a1a3b0> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "__pair_base<const int, void *>", scope: <0x25ef528>, file: <0x28fa578>, line: 190, size: 8, elements: <0x2537ba0>, templateParams: <0x2a1a750>, identifier: "_ZTSSt11__pair_baseIKiPvE")
TYCHE[32] = [32..33] = FileName: CWE843_Type_Confusion__short_74_V2b.cpp
	<0x2a1a6a0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x25ef528>, file: <0x29acd58>, line: 216, size: 384, elements: <0x2a1e880>, templateParams: <0x2a1ccd8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x2a1cf38> = !DIDerivedType(tag: DW_TAG_member, name: "_M_value_field", scope: <0x2a1a6a0>, file: <0x29acd58>, line: 221, baseType: <0x2a1a330>, size: 128, offset: 256)
	<0x2a1a330> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x25ef528>, file: <0x28fa578>, line: 208, size: 128, elements: <0x2a19f88>, templateParams: <0x2a1a430>, identifier: "_ZTSSt4pairIKiPvE")
	<0x2a14ef8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x2a1a330>, baseType: <0x2a1a3b0>, flags: DIFlagPrivate)
	<0x2a1a330> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x25ef528>, file: <0x28fa578>, line: 208, size: 128, elements: <0x2a19f88>, templateParams: <0x2a1a430>, identifier: "_ZTSSt4pairIKiPvE")
<0x2533828> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x2698428>, size: 64)
TYCHE[40] = [40..48] = FileName: CWE843_Type_Confusion__short_74_V2b.cpp
	<0x2a1a6a0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x25ef528>, file: <0x29acd58>, line: 216, size: 384, elements: <0x2a1e880>, templateParams: <0x2a1ccd8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x2a1cf38> = !DIDerivedType(tag: DW_TAG_member, name: "_M_value_field", scope: <0x2a1a6a0>, file: <0x29acd58>, line: 221, baseType: <0x2a1a330>, size: 128, offset: 256)
	<0x2a1a330> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x25ef528>, file: <0x28fa578>, line: 208, size: 128, elements: <0x2a19f88>, templateParams: <0x2a1a430>, identifier: "_ZTSSt4pairIKiPvE")
	<0x2a1a808> = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: <0x2a1a330>, file: <0x28fa578>, line: 215, baseType: <0x2699c28>, size: 64, offset: 64)
	<0x2a1a330> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x25ef528>, file: <0x28fa578>, line: 208, size: 128, elements: <0x2a19f88>, templateParams: <0x2a1a430>, identifier: "_ZTSSt4pairIKiPvE")
<0x2533828> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x2698428>, size: 64)
TYCHE[40] = [40..48] = FileName: CWE843_Type_Confusion__short_74_V2b.cpp
	<0x2a1a6a0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x25ef528>, file: <0x29acd58>, line: 216, size: 384, elements: <0x2a1e880>, templateParams: <0x2a1ccd8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x2a1cf38> = !DIDerivedType(tag: DW_TAG_member, name: "_M_value_field", scope: <0x2a1a6a0>, file: <0x29acd58>, line: 221, baseType: <0x2a1a330>, size: 128, offset: 256)
	<0x2a1a330> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x25ef528>, file: <0x28fa578>, line: 208, size: 128, elements: <0x2a19f88>, templateParams: <0x2a1a430>, identifier: "_ZTSSt4pairIKiPvE")
	<0x2a1a808> = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: <0x2a1a330>, file: <0x28fa578>, line: 215, baseType: <0x2699c28>, size: 64, offset: 64)
	<0x2a1a330> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x25ef528>, file: <0x28fa578>, line: 208, size: 128, elements: <0x2a19f88>, templateParams: <0x2a1a430>, identifier: "_ZTSSt4pairIKiPvE")
CWE843_Type_Confusion__short_74_V2b.cpp#111_27##0#4294967295
AllocationPointsDIInfo[44528520] Size: 15
--------------------------------------------------------------------------------------------------------------
