AllocationPointsTypeInfo[TypeId] Size: 1
<0xb79d98> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
TYCHE[0] = [18446744056529682432..17179869184] = FileName: ../../testcasesupport/io.c
	<0xb79d98> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
AllocationPointsTypeInfo[TypeId] Size: 1
<0x13c4988> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
TYCHE[0] = [18446744056529682432..17179869184] = FileName: CWE843_Type_Confusion__short_74_V1a.cpp
	<0x13c4988> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
AllocationPointsTypeInfo[TypeId] Size: 18
<0x16e7e90> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_key_compare<std::less<int> >", scope: <0x131ba88>, file: <0x13d9268>, line: 142, size: 8, elements: <0x16e8e08>, templateParams: <0x16e80a8>, identifier: "_ZTSSt20_Rb_tree_key_compareISt4lessIiEE")
TYCHE[0] = [0..1] = FileName: CWE843_Type_Confusion__short_74_V1a.cpp
	<0x16269a0> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "map<int, void *, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x131ba88>, file: <0x131ba08>, line: 100, size: 384, elements: <0x123ff60>, templateParams: <0x13d91d0>, identifier: "_ZTSSt3mapIiPvSt4lessIiESaISt4pairIKiS0_EEE")
	<0x16eb6d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_t", scope: <0x16269a0>, file: <0x131ba08>, line: 151, baseType: <0x170e098>, size: 384)

	<0x16d73d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_impl", scope: <0x13cf280>, file: <0x13d9268>, line: 713, baseType: <0x13d9530>, size: 384, flags: DIFlagProtected)
	<0x13d9530> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_impl<std::less<int>, false>", scope: <0x13cf280>, file: <0x13d9268>, line: 681, size: 384, elements: <0x16d7580>, templateParams: <0x13c95b0>, identifier: "_ZTSNSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE13_Rb_tree_implIS7_Lb0EEE")
	<0x16d0cb8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x13d9530>, baseType: <0x16e8060>, offset: 64)
	<0x16e8060> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_header", scope: <0x131ba88>, file: <0x13d9268>, line: 168, size: 320, elements: <0x16d0ee8>, identifier: "_ZTSSt15_Rb_tree_header")
	<0x16d08d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_header", scope: <0x16e8060>, file: <0x13d9268>, line: 170, baseType: <0x16e8e70>, size: 256)
	<0x16e8060> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_header", scope: <0x131ba88>, file: <0x13d9268>, line: 168, size: 320, elements: <0x16d0ee8>, identifier: "_ZTSSt15_Rb_tree_header")
<0x134fbf8> = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
TYCHE[8] = [8..12] = FileName: CWE843_Type_Confusion__short_74_V1a.cpp
	<0x16269a0> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "map<int, void *, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x131ba88>, file: <0x131ba08>, line: 100, size: 384, elements: <0x123ff60>, templateParams: <0x13d91d0>, identifier: "_ZTSSt3mapIiPvSt4lessIiESaISt4pairIKiS0_EEE")
	<0x16eb6d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_t", scope: <0x16269a0>, file: <0x131ba08>, line: 151, baseType: <0x170e098>, size: 384)
	<0x13cf280> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "_Rb_tree<int, std::pair<const int, void *>, std::_Select1st<std::pair<const int, void *> >, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x131ba88>, file: <0x13d9268>, line: 444, size: 384, elements: <0x1317a78>, templateParams: <0x1535d88>, identifier: "_ZTSSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE")
	<0x16d73d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_impl", scope: <0x13cf280>, file: <0x13d9268>, line: 713, baseType: <0x13d9530>, size: 384, flags: DIFlagProtected)
	<0x13d9530> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_impl<std::less<int>, false>", scope: <0x13cf280>, file: <0x13d9268>, line: 681, size: 384, elements: <0x16d7580>, templateParams: <0x13c95b0>, identifier: "_ZTSNSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE13_Rb_tree_implIS7_Lb0EEE")
	<0x16d0cb8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x13d9530>, baseType: <0x16e8060>, offset: 64)
	<0x16e8060> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_header", scope: <0x131ba88>, file: <0x13d9268>, line: 168, size: 320, elements: <0x16d0ee8>, identifier: "_ZTSSt15_Rb_tree_header")
	<0x16d08d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_header", scope: <0x16e8060>, file: <0x13d9268>, line: 170, baseType: <0x16e8e70>, size: 256)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x16e91f8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_color", scope: <0x16e8e70>, file: <0x13d9268>, line: 106, baseType: <0x16e8ef0>, size: 32)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x16e9268> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x16e8e70>, size: 64)
TYCHE[16] = [16..24] = FileName: CWE843_Type_Confusion__short_74_V1a.cpp
	<0x16269a0> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "map<int, void *, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x131ba88>, file: <0x131ba08>, line: 100, size: 384, elements: <0x123ff60>, templateParams: <0x13d91d0>, identifier: "_ZTSSt3mapIiPvSt4lessIiESaISt4pairIKiS0_EEE")
	<0x16eb6d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_t", scope: <0x16269a0>, file: <0x131ba08>, line: 151, baseType: <0x170e098>, size: 384)
	<0x13cf280> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "_Rb_tree<int, std::pair<const int, void *>, std::_Select1st<std::pair<const int, void *> >, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x131ba88>, file: <0x13d9268>, line: 444, size: 384, elements: <0x1317a78>, templateParams: <0x1535d88>, identifier: "_ZTSSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE")
	<0x16d73d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_impl", scope: <0x13cf280>, file: <0x13d9268>, line: 713, baseType: <0x13d9530>, size: 384, flags: DIFlagProtected)
	<0x13d9530> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_impl<std::less<int>, false>", scope: <0x13cf280>, file: <0x13d9268>, line: 681, size: 384, elements: <0x16d7580>, templateParams: <0x13c95b0>, identifier: "_ZTSNSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE13_Rb_tree_implIS7_Lb0EEE")
	<0x16d0cb8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x13d9530>, baseType: <0x16e8060>, offset: 64)
	<0x16e8060> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_header", scope: <0x131ba88>, file: <0x13d9268>, line: 168, size: 320, elements: <0x16d0ee8>, identifier: "_ZTSSt15_Rb_tree_header")
	<0x16d08d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_header", scope: <0x16e8060>, file: <0x13d9268>, line: 170, baseType: <0x16e8e70>, size: 256)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x16e9348> = !DIDerivedType(tag: DW_TAG_member, name: "_M_parent", scope: <0x16e8e70>, file: <0x13d9268>, line: 107, baseType: <0x16e92d8>, size: 64, offset: 64)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x16e9268> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x16e8e70>, size: 64)
TYCHE[16] = [16..24] = FileName: CWE843_Type_Confusion__short_74_V1a.cpp
	<0x16269a0> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "map<int, void *, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x131ba88>, file: <0x131ba08>, line: 100, size: 384, elements: <0x123ff60>, templateParams: <0x13d91d0>, identifier: "_ZTSSt3mapIiPvSt4lessIiESaISt4pairIKiS0_EEE")
	<0x16eb6d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_t", scope: <0x16269a0>, file: <0x131ba08>, line: 151, baseType: <0x170e098>, size: 384)
	<0x13cf280> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "_Rb_tree<int, std::pair<const int, void *>, std::_Select1st<std::pair<const int, void *> >, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x131ba88>, file: <0x13d9268>, line: 444, size: 384, elements: <0x1317a78>, templateParams: <0x1535d88>, identifier: "_ZTSSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE")
	<0x16d73d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_impl", scope: <0x13cf280>, file: <0x13d9268>, line: 713, baseType: <0x13d9530>, size: 384, flags: DIFlagProtected)
	<0x13d9530> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_impl<std::less<int>, false>", scope: <0x13cf280>, file: <0x13d9268>, line: 681, size: 384, elements: <0x16d7580>, templateParams: <0x13c95b0>, identifier: "_ZTSNSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE13_Rb_tree_implIS7_Lb0EEE")
	<0x16d0cb8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x13d9530>, baseType: <0x16e8060>, offset: 64)
	<0x16e8060> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_header", scope: <0x131ba88>, file: <0x13d9268>, line: 168, size: 320, elements: <0x16d0ee8>, identifier: "_ZTSSt15_Rb_tree_header")
	<0x16d08d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_header", scope: <0x16e8060>, file: <0x13d9268>, line: 170, baseType: <0x16e8e70>, size: 256)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x16e9348> = !DIDerivedType(tag: DW_TAG_member, name: "_M_parent", scope: <0x16e8e70>, file: <0x13d9268>, line: 107, baseType: <0x16e92d8>, size: 64, offset: 64)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x16e9268> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x16e8e70>, size: 64)
TYCHE[24] = [24..32] = FileName: CWE843_Type_Confusion__short_74_V1a.cpp
	<0x16269a0> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "map<int, void *, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x131ba88>, file: <0x131ba08>, line: 100, size: 384, elements: <0x123ff60>, templateParams: <0x13d91d0>, identifier: "_ZTSSt3mapIiPvSt4lessIiESaISt4pairIKiS0_EEE")
	<0x16eb6d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_t", scope: <0x16269a0>, file: <0x131ba08>, line: 151, baseType: <0x170e098>, size: 384)
	<0x13cf280> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "_Rb_tree<int, std::pair<const int, void *>, std::_Select1st<std::pair<const int, void *> >, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x131ba88>, file: <0x13d9268>, line: 444, size: 384, elements: <0x1317a78>, templateParams: <0x1535d88>, identifier: "_ZTSSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE")
	<0x16d73d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_impl", scope: <0x13cf280>, file: <0x13d9268>, line: 713, baseType: <0x13d9530>, size: 384, flags: DIFlagProtected)
	<0x13d9530> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_impl<std::less<int>, false>", scope: <0x13cf280>, file: <0x13d9268>, line: 681, size: 384, elements: <0x16d7580>, templateParams: <0x13c95b0>, identifier: "_ZTSNSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE13_Rb_tree_implIS7_Lb0EEE")
	<0x16d0cb8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x13d9530>, baseType: <0x16e8060>, offset: 64)
	<0x16e8060> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_header", scope: <0x131ba88>, file: <0x13d9268>, line: 168, size: 320, elements: <0x16d0ee8>, identifier: "_ZTSSt15_Rb_tree_header")
	<0x16d08d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_header", scope: <0x16e8060>, file: <0x13d9268>, line: 170, baseType: <0x16e8e70>, size: 256)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x16e93b8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_left", scope: <0x16e8e70>, file: <0x13d9268>, line: 108, baseType: <0x16e92d8>, size: 64, offset: 128)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x16e9268> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x16e8e70>, size: 64)
TYCHE[24] = [24..32] = FileName: CWE843_Type_Confusion__short_74_V1a.cpp
	<0x16269a0> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "map<int, void *, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x131ba88>, file: <0x131ba08>, line: 100, size: 384, elements: <0x123ff60>, templateParams: <0x13d91d0>, identifier: "_ZTSSt3mapIiPvSt4lessIiESaISt4pairIKiS0_EEE")
	<0x16eb6d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_t", scope: <0x16269a0>, file: <0x131ba08>, line: 151, baseType: <0x170e098>, size: 384)
	<0x13cf280> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "_Rb_tree<int, std::pair<const int, void *>, std::_Select1st<std::pair<const int, void *> >, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x131ba88>, file: <0x13d9268>, line: 444, size: 384, elements: <0x1317a78>, templateParams: <0x1535d88>, identifier: "_ZTSSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE")
	<0x16d73d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_impl", scope: <0x13cf280>, file: <0x13d9268>, line: 713, baseType: <0x13d9530>, size: 384, flags: DIFlagProtected)
	<0x13d9530> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_impl<std::less<int>, false>", scope: <0x13cf280>, file: <0x13d9268>, line: 681, size: 384, elements: <0x16d7580>, templateParams: <0x13c95b0>, identifier: "_ZTSNSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE13_Rb_tree_implIS7_Lb0EEE")
	<0x16d0cb8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x13d9530>, baseType: <0x16e8060>, offset: 64)
	<0x16e8060> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_header", scope: <0x131ba88>, file: <0x13d9268>, line: 168, size: 320, elements: <0x16d0ee8>, identifier: "_ZTSSt15_Rb_tree_header")
	<0x16d08d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_header", scope: <0x16e8060>, file: <0x13d9268>, line: 170, baseType: <0x16e8e70>, size: 256)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x16e93b8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_left", scope: <0x16e8e70>, file: <0x13d9268>, line: 108, baseType: <0x16e92d8>, size: 64, offset: 128)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x16e9268> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x16e8e70>, size: 64)
TYCHE[32] = [32..40] = FileName: CWE843_Type_Confusion__short_74_V1a.cpp
	<0x16269a0> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "map<int, void *, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x131ba88>, file: <0x131ba08>, line: 100, size: 384, elements: <0x123ff60>, templateParams: <0x13d91d0>, identifier: "_ZTSSt3mapIiPvSt4lessIiESaISt4pairIKiS0_EEE")
	<0x16eb6d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_t", scope: <0x16269a0>, file: <0x131ba08>, line: 151, baseType: <0x170e098>, size: 384)
	<0x13cf280> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "_Rb_tree<int, std::pair<const int, void *>, std::_Select1st<std::pair<const int, void *> >, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x131ba88>, file: <0x13d9268>, line: 444, size: 384, elements: <0x1317a78>, templateParams: <0x1535d88>, identifier: "_ZTSSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE")
	<0x16d73d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_impl", scope: <0x13cf280>, file: <0x13d9268>, line: 713, baseType: <0x13d9530>, size: 384, flags: DIFlagProtected)
	<0x13d9530> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_impl<std::less<int>, false>", scope: <0x13cf280>, file: <0x13d9268>, line: 681, size: 384, elements: <0x16d7580>, templateParams: <0x13c95b0>, identifier: "_ZTSNSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE13_Rb_tree_implIS7_Lb0EEE")
	<0x16d0cb8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x13d9530>, baseType: <0x16e8060>, offset: 64)
	<0x16e8060> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_header", scope: <0x131ba88>, file: <0x13d9268>, line: 168, size: 320, elements: <0x16d0ee8>, identifier: "_ZTSSt15_Rb_tree_header")
	<0x16d08d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_header", scope: <0x16e8060>, file: <0x13d9268>, line: 170, baseType: <0x16e8e70>, size: 256)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x16d0358> = !DIDerivedType(tag: DW_TAG_member, name: "_M_right", scope: <0x16e8e70>, file: <0x13d9268>, line: 109, baseType: <0x16e92d8>, size: 64, offset: 192)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x16e9268> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x16e8e70>, size: 64)
TYCHE[32] = [32..40] = FileName: CWE843_Type_Confusion__short_74_V1a.cpp
	<0x16269a0> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "map<int, void *, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x131ba88>, file: <0x131ba08>, line: 100, size: 384, elements: <0x123ff60>, templateParams: <0x13d91d0>, identifier: "_ZTSSt3mapIiPvSt4lessIiESaISt4pairIKiS0_EEE")
	<0x16eb6d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_t", scope: <0x16269a0>, file: <0x131ba08>, line: 151, baseType: <0x170e098>, size: 384)
	<0x13cf280> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "_Rb_tree<int, std::pair<const int, void *>, std::_Select1st<std::pair<const int, void *> >, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x131ba88>, file: <0x13d9268>, line: 444, size: 384, elements: <0x1317a78>, templateParams: <0x1535d88>, identifier: "_ZTSSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE")
	<0x16d73d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_impl", scope: <0x13cf280>, file: <0x13d9268>, line: 713, baseType: <0x13d9530>, size: 384, flags: DIFlagProtected)
	<0x13d9530> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_impl<std::less<int>, false>", scope: <0x13cf280>, file: <0x13d9268>, line: 681, size: 384, elements: <0x16d7580>, templateParams: <0x13c95b0>, identifier: "_ZTSNSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE13_Rb_tree_implIS7_Lb0EEE")
	<0x16d0cb8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x13d9530>, baseType: <0x16e8060>, offset: 64)
	<0x16e8060> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_header", scope: <0x131ba88>, file: <0x13d9268>, line: 168, size: 320, elements: <0x16d0ee8>, identifier: "_ZTSSt15_Rb_tree_header")
	<0x16d08d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_header", scope: <0x16e8060>, file: <0x13d9268>, line: 170, baseType: <0x16e8e70>, size: 256)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x16d0358> = !DIDerivedType(tag: DW_TAG_member, name: "_M_right", scope: <0x16e8e70>, file: <0x13d9268>, line: 109, baseType: <0x16e92d8>, size: 64, offset: 192)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x13d12b8> = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
TYCHE[40] = [40..48] = FileName: CWE843_Type_Confusion__short_74_V1a.cpp
	<0x16269a0> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "map<int, void *, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x131ba88>, file: <0x131ba08>, line: 100, size: 384, elements: <0x123ff60>, templateParams: <0x13d91d0>, identifier: "_ZTSSt3mapIiPvSt4lessIiESaISt4pairIKiS0_EEE")
	<0x16eb6d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_t", scope: <0x16269a0>, file: <0x131ba08>, line: 151, baseType: <0x170e098>, size: 384)
	<0x13cf280> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "_Rb_tree<int, std::pair<const int, void *>, std::_Select1st<std::pair<const int, void *> >, std::less<int>, std::allocator<std::pair<const int, void *> > >", scope: <0x131ba88>, file: <0x13d9268>, line: 444, size: 384, elements: <0x1317a78>, templateParams: <0x1535d88>, identifier: "_ZTSSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE")
	<0x16d73d8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_impl", scope: <0x13cf280>, file: <0x13d9268>, line: 713, baseType: <0x13d9530>, size: 384, flags: DIFlagProtected)
	<0x13d9530> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_impl<std::less<int>, false>", scope: <0x13cf280>, file: <0x13d9268>, line: 681, size: 384, elements: <0x16d7580>, templateParams: <0x13c95b0>, identifier: "_ZTSNSt8_Rb_treeIiSt4pairIKiPvESt10_Select1stIS3_ESt4lessIiESaIS3_EE13_Rb_tree_implIS7_Lb0EEE")
	<0x16d0cb8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x13d9530>, baseType: <0x16e8060>, offset: 64)
	<0x16e8060> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_header", scope: <0x131ba88>, file: <0x13d9268>, line: 168, size: 320, elements: <0x16d0ee8>, identifier: "_ZTSSt15_Rb_tree_header")
	<0x16d0948> = !DIDerivedType(tag: DW_TAG_member, name: "_M_node_count", scope: <0x16e8060>, file: <0x13d9268>, line: 171, baseType: <0x13761e8>, size: 64, offset: 256)
	<0x16e8060> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_header", scope: <0x131ba88>, file: <0x13d9268>, line: 168, size: 320, elements: <0x16d0ee8>, identifier: "_ZTSSt15_Rb_tree_header")
CWE843_Type_Confusion__short_74_V1a.cpp#33_34##139696643219539#1
AllocationPointsDIInfo[24351832] Size: 19
--------------------------------------------------------------------------------------------------------------
AllocationPointsTypeInfo[TypeId] Size: 14
<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
TYCHE[0] = [0..32] = FileName: CWE843_Type_Confusion__short_74_V1a.cpp
	<0x17459f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x131ba88>, file: <0x13d9268>, line: 216, size: 384, elements: <0x17468c0>, templateParams: <0x17417d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x1741498> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x17459f0>, baseType: <0x16e8e70>)
	<0x17459f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x131ba88>, file: <0x13d9268>, line: 216, size: 384, elements: <0x17468c0>, templateParams: <0x17417d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
<0x134fbf8> = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
TYCHE[0] = [0..4] = FileName: CWE843_Type_Confusion__short_74_V1a.cpp
	<0x17459f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x131ba88>, file: <0x13d9268>, line: 216, size: 384, elements: <0x17468c0>, templateParams: <0x17417d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x1741498> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x17459f0>, baseType: <0x16e8e70>)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x16e91f8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_color", scope: <0x16e8e70>, file: <0x13d9268>, line: 106, baseType: <0x16e8ef0>, size: 32)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x17459f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x131ba88>, file: <0x13d9268>, line: 216, size: 384, elements: <0x17468c0>, templateParams: <0x17417d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
TYCHE[0] = [18446744056529682432..17179869184] = FileName: CWE843_Type_Confusion__short_74_V1a.cpp
	<0x17459f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x131ba88>, file: <0x13d9268>, line: 216, size: 384, elements: <0x17468c0>, templateParams: <0x17417d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
<0x16e9268> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x16e8e70>, size: 64)
TYCHE[8] = [8..16] = FileName: CWE843_Type_Confusion__short_74_V1a.cpp
	<0x17459f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x131ba88>, file: <0x13d9268>, line: 216, size: 384, elements: <0x17468c0>, templateParams: <0x17417d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x1741498> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x17459f0>, baseType: <0x16e8e70>)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x16e9348> = !DIDerivedType(tag: DW_TAG_member, name: "_M_parent", scope: <0x16e8e70>, file: <0x13d9268>, line: 107, baseType: <0x16e92d8>, size: 64, offset: 64)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x16e9268> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x16e8e70>, size: 64)
TYCHE[8] = [8..16] = FileName: CWE843_Type_Confusion__short_74_V1a.cpp
	<0x17459f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x131ba88>, file: <0x13d9268>, line: 216, size: 384, elements: <0x17468c0>, templateParams: <0x17417d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x1741498> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x17459f0>, baseType: <0x16e8e70>)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x16e9348> = !DIDerivedType(tag: DW_TAG_member, name: "_M_parent", scope: <0x16e8e70>, file: <0x13d9268>, line: 107, baseType: <0x16e92d8>, size: 64, offset: 64)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x16e9268> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x16e8e70>, size: 64)
TYCHE[16] = [16..24] = FileName: CWE843_Type_Confusion__short_74_V1a.cpp
	<0x17459f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x131ba88>, file: <0x13d9268>, line: 216, size: 384, elements: <0x17468c0>, templateParams: <0x17417d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x1741498> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x17459f0>, baseType: <0x16e8e70>)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x16e93b8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_left", scope: <0x16e8e70>, file: <0x13d9268>, line: 108, baseType: <0x16e92d8>, size: 64, offset: 128)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x16e9268> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x16e8e70>, size: 64)
TYCHE[16] = [16..24] = FileName: CWE843_Type_Confusion__short_74_V1a.cpp
	<0x17459f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x131ba88>, file: <0x13d9268>, line: 216, size: 384, elements: <0x17468c0>, templateParams: <0x17417d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x1741498> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x17459f0>, baseType: <0x16e8e70>)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x16e93b8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_left", scope: <0x16e8e70>, file: <0x13d9268>, line: 108, baseType: <0x16e92d8>, size: 64, offset: 128)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x16e9268> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x16e8e70>, size: 64)
TYCHE[24] = [24..32] = FileName: CWE843_Type_Confusion__short_74_V1a.cpp
	<0x17459f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x131ba88>, file: <0x13d9268>, line: 216, size: 384, elements: <0x17468c0>, templateParams: <0x17417d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x1741498> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x17459f0>, baseType: <0x16e8e70>)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x16d0358> = !DIDerivedType(tag: DW_TAG_member, name: "_M_right", scope: <0x16e8e70>, file: <0x13d9268>, line: 109, baseType: <0x16e92d8>, size: 64, offset: 192)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x16e9268> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x16e8e70>, size: 64)
TYCHE[24] = [24..32] = FileName: CWE843_Type_Confusion__short_74_V1a.cpp
	<0x17459f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x131ba88>, file: <0x13d9268>, line: 216, size: 384, elements: <0x17468c0>, templateParams: <0x17417d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x1741498> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x17459f0>, baseType: <0x16e8e70>)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x16d0358> = !DIDerivedType(tag: DW_TAG_member, name: "_M_right", scope: <0x16e8e70>, file: <0x13d9268>, line: 109, baseType: <0x16e92d8>, size: 64, offset: 192)
	<0x16e8e70> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x131ba88>, file: <0x13d9268>, line: 101, size: 256, elements: <0x16d0890>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x1534990> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x131ba88>, file: <0x1534a78>, line: 208, size: 128, elements: <0x1631de8>, templateParams: <0x1539650>, identifier: "_ZTSSt4pairIKiPvE")
TYCHE[32] = [32..48] = FileName: CWE843_Type_Confusion__short_74_V1a.cpp
	<0x17459f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x131ba88>, file: <0x13d9268>, line: 216, size: 384, elements: <0x17468c0>, templateParams: <0x17417d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x1746228> = !DIDerivedType(tag: DW_TAG_member, name: "_M_value_field", scope: <0x17459f0>, file: <0x13d9268>, line: 221, baseType: <0x1534990>, size: 128, offset: 256)
	<0x17459f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x131ba88>, file: <0x13d9268>, line: 216, size: 384, elements: <0x17468c0>, templateParams: <0x17417d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
<0x134fbf8> = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
TYCHE[32] = [32..36] = FileName: CWE843_Type_Confusion__short_74_V1a.cpp
	<0x17459f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x131ba88>, file: <0x13d9268>, line: 216, size: 384, elements: <0x17468c0>, templateParams: <0x17417d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x1746228> = !DIDerivedType(tag: DW_TAG_member, name: "_M_value_field", scope: <0x17459f0>, file: <0x13d9268>, line: 221, baseType: <0x1534990>, size: 128, offset: 256)
	<0x1534990> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x131ba88>, file: <0x1534a78>, line: 208, size: 128, elements: <0x1631de8>, templateParams: <0x1539650>, identifier: "_ZTSSt4pairIKiPvE")
	<0x162e208> = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: <0x1534990>, file: <0x1534a78>, line: 214, baseType: <0x15f03e8>, size: 32)
	<0x1534990> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x131ba88>, file: <0x1534a78>, line: 208, size: 128, elements: <0x1631de8>, templateParams: <0x1539650>, identifier: "_ZTSSt4pairIKiPvE")
<0x1534ae0> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "__pair_base<const int, void *>", scope: <0x131ba88>, file: <0x1534a78>, line: 190, size: 8, elements: <0x12983f0>, templateParams: <0x162e1c0>, identifier: "_ZTSSt11__pair_baseIKiPvE")
TYCHE[32] = [32..33] = FileName: CWE843_Type_Confusion__short_74_V1a.cpp
	<0x17459f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x131ba88>, file: <0x13d9268>, line: 216, size: 384, elements: <0x17468c0>, templateParams: <0x17417d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x1746228> = !DIDerivedType(tag: DW_TAG_member, name: "_M_value_field", scope: <0x17459f0>, file: <0x13d9268>, line: 221, baseType: <0x1534990>, size: 128, offset: 256)
	<0x1534990> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x131ba88>, file: <0x1534a78>, line: 208, size: 128, elements: <0x1631de8>, templateParams: <0x1539650>, identifier: "_ZTSSt4pairIKiPvE")
	<0x162e7e8> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x1534990>, baseType: <0x1534ae0>, flags: DIFlagPrivate)
	<0x1534990> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x131ba88>, file: <0x1534a78>, line: 208, size: 128, elements: <0x1631de8>, templateParams: <0x1539650>, identifier: "_ZTSSt4pairIKiPvE")
<0x125f828> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x13c4988>, size: 64)
TYCHE[40] = [40..48] = FileName: CWE843_Type_Confusion__short_74_V1a.cpp
	<0x17459f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x131ba88>, file: <0x13d9268>, line: 216, size: 384, elements: <0x17468c0>, templateParams: <0x17417d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x1746228> = !DIDerivedType(tag: DW_TAG_member, name: "_M_value_field", scope: <0x17459f0>, file: <0x13d9268>, line: 221, baseType: <0x1534990>, size: 128, offset: 256)
	<0x1534990> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x131ba88>, file: <0x1534a78>, line: 208, size: 128, elements: <0x1631de8>, templateParams: <0x1539650>, identifier: "_ZTSSt4pairIKiPvE")
	<0x162e278> = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: <0x1534990>, file: <0x1534a78>, line: 215, baseType: <0x13c6188>, size: 64, offset: 64)
	<0x1534990> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x131ba88>, file: <0x1534a78>, line: 208, size: 128, elements: <0x1631de8>, templateParams: <0x1539650>, identifier: "_ZTSSt4pairIKiPvE")
<0x125f828> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x13c4988>, size: 64)
TYCHE[40] = [40..48] = FileName: CWE843_Type_Confusion__short_74_V1a.cpp
	<0x17459f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x131ba88>, file: <0x13d9268>, line: 216, size: 384, elements: <0x17468c0>, templateParams: <0x17417d8>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x1746228> = !DIDerivedType(tag: DW_TAG_member, name: "_M_value_field", scope: <0x17459f0>, file: <0x13d9268>, line: 221, baseType: <0x1534990>, size: 128, offset: 256)
	<0x1534990> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x131ba88>, file: <0x1534a78>, line: 208, size: 128, elements: <0x1631de8>, templateParams: <0x1539650>, identifier: "_ZTSSt4pairIKiPvE")
	<0x162e278> = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: <0x1534990>, file: <0x1534a78>, line: 215, baseType: <0x13c6188>, size: 64, offset: 64)
	<0x1534990> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x131ba88>, file: <0x1534a78>, line: 208, size: 128, elements: <0x1631de8>, templateParams: <0x1539650>, identifier: "_ZTSSt4pairIKiPvE")
CWE843_Type_Confusion__short_74_V1a.cpp#111_27##139696643219539#1
AllocationPointsDIInfo[24765640] Size: 33
--------------------------------------------------------------------------------------------------------------
AllocationPointsTypeInfo[TypeId] Size: 1
<0x18e6418> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
TYCHE[0] = [18446744056529682432..17179869184] = FileName: CWE843_Type_Confusion__short_74_V1b.cpp
	<0x18e6418> = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
AllocationPointsTypeInfo[TypeId] Size: 14
<0x1c0aa40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x183d518>, file: <0x1bfad48>, line: 101, size: 256, elements: <0x1c0bb30>, identifier: "_ZTSSt18_Rb_tree_node_base")
TYCHE[0] = [0..32] = FileName: CWE843_Type_Confusion__short_74_V1b.cpp
	<0x1c684f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x183d518>, file: <0x1bfad48>, line: 216, size: 384, elements: <0x1c6c6d0>, templateParams: <0x1c6ab28>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x1c68a48> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x1c684f0>, baseType: <0x1c0aa40>)
	<0x1c684f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x183d518>, file: <0x1bfad48>, line: 216, size: 384, elements: <0x1c6c6d0>, templateParams: <0x1c6ab28>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
<0x1871688> = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
TYCHE[0] = [0..4] = FileName: CWE843_Type_Confusion__short_74_V1b.cpp
	<0x1c684f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x183d518>, file: <0x1bfad48>, line: 216, size: 384, elements: <0x1c6c6d0>, templateParams: <0x1c6ab28>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x1c68a48> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x1c684f0>, baseType: <0x1c0aa40>)
	<0x1c0aa40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x183d518>, file: <0x1bfad48>, line: 101, size: 256, elements: <0x1c0bb30>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x1c0abb8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_color", scope: <0x1c0aa40>, file: <0x1bfad48>, line: 106, baseType: <0x1c0aac0>, size: 32)
	<0x1c0aa40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x183d518>, file: <0x1bfad48>, line: 101, size: 256, elements: <0x1c0bb30>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x1c684f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x183d518>, file: <0x1bfad48>, line: 216, size: 384, elements: <0x1c6c6d0>, templateParams: <0x1c6ab28>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
TYCHE[0] = [18446744056529682432..17179869184] = FileName: CWE843_Type_Confusion__short_74_V1b.cpp
	<0x1c684f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x183d518>, file: <0x1bfad48>, line: 216, size: 384, elements: <0x1c6c6d0>, templateParams: <0x1c6ab28>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
<0x1c0ac28> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x1c0aa40>, size: 64)
TYCHE[8] = [8..16] = FileName: CWE843_Type_Confusion__short_74_V1b.cpp
	<0x1c684f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x183d518>, file: <0x1bfad48>, line: 216, size: 384, elements: <0x1c6c6d0>, templateParams: <0x1c6ab28>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x1c68a48> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x1c684f0>, baseType: <0x1c0aa40>)
	<0x1c0aa40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x183d518>, file: <0x1bfad48>, line: 101, size: 256, elements: <0x1c0bb30>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x1c0ad08> = !DIDerivedType(tag: DW_TAG_member, name: "_M_parent", scope: <0x1c0aa40>, file: <0x1bfad48>, line: 107, baseType: <0x1c0ac98>, size: 64, offset: 64)
	<0x1c0aa40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x183d518>, file: <0x1bfad48>, line: 101, size: 256, elements: <0x1c0bb30>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x1c0ac28> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x1c0aa40>, size: 64)
TYCHE[8] = [8..16] = FileName: CWE843_Type_Confusion__short_74_V1b.cpp
	<0x1c684f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x183d518>, file: <0x1bfad48>, line: 216, size: 384, elements: <0x1c6c6d0>, templateParams: <0x1c6ab28>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x1c68a48> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x1c684f0>, baseType: <0x1c0aa40>)
	<0x1c0aa40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x183d518>, file: <0x1bfad48>, line: 101, size: 256, elements: <0x1c0bb30>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x1c0ad08> = !DIDerivedType(tag: DW_TAG_member, name: "_M_parent", scope: <0x1c0aa40>, file: <0x1bfad48>, line: 107, baseType: <0x1c0ac98>, size: 64, offset: 64)
	<0x1c0aa40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x183d518>, file: <0x1bfad48>, line: 101, size: 256, elements: <0x1c0bb30>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x1c0ac28> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x1c0aa40>, size: 64)
TYCHE[16] = [16..24] = FileName: CWE843_Type_Confusion__short_74_V1b.cpp
	<0x1c684f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x183d518>, file: <0x1bfad48>, line: 216, size: 384, elements: <0x1c6c6d0>, templateParams: <0x1c6ab28>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x1c68a48> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x1c684f0>, baseType: <0x1c0aa40>)
	<0x1c0aa40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x183d518>, file: <0x1bfad48>, line: 101, size: 256, elements: <0x1c0bb30>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x1c0ad78> = !DIDerivedType(tag: DW_TAG_member, name: "_M_left", scope: <0x1c0aa40>, file: <0x1bfad48>, line: 108, baseType: <0x1c0ac98>, size: 64, offset: 128)
	<0x1c0aa40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x183d518>, file: <0x1bfad48>, line: 101, size: 256, elements: <0x1c0bb30>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x1c0ac28> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x1c0aa40>, size: 64)
TYCHE[16] = [16..24] = FileName: CWE843_Type_Confusion__short_74_V1b.cpp
	<0x1c684f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x183d518>, file: <0x1bfad48>, line: 216, size: 384, elements: <0x1c6c6d0>, templateParams: <0x1c6ab28>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x1c68a48> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x1c684f0>, baseType: <0x1c0aa40>)
	<0x1c0aa40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x183d518>, file: <0x1bfad48>, line: 101, size: 256, elements: <0x1c0bb30>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x1c0ad78> = !DIDerivedType(tag: DW_TAG_member, name: "_M_left", scope: <0x1c0aa40>, file: <0x1bfad48>, line: 108, baseType: <0x1c0ac98>, size: 64, offset: 128)
	<0x1c0aa40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x183d518>, file: <0x1bfad48>, line: 101, size: 256, elements: <0x1c0bb30>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x1c0ac28> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x1c0aa40>, size: 64)
TYCHE[24] = [24..32] = FileName: CWE843_Type_Confusion__short_74_V1b.cpp
	<0x1c684f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x183d518>, file: <0x1bfad48>, line: 216, size: 384, elements: <0x1c6c6d0>, templateParams: <0x1c6ab28>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x1c68a48> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x1c684f0>, baseType: <0x1c0aa40>)
	<0x1c0aa40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x183d518>, file: <0x1bfad48>, line: 101, size: 256, elements: <0x1c0bb30>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x1c0b5f8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_right", scope: <0x1c0aa40>, file: <0x1bfad48>, line: 109, baseType: <0x1c0ac98>, size: 64, offset: 192)
	<0x1c0aa40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x183d518>, file: <0x1bfad48>, line: 101, size: 256, elements: <0x1c0bb30>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x1c0ac28> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x1c0aa40>, size: 64)
TYCHE[24] = [24..32] = FileName: CWE843_Type_Confusion__short_74_V1b.cpp
	<0x1c684f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x183d518>, file: <0x1bfad48>, line: 216, size: 384, elements: <0x1c6c6d0>, templateParams: <0x1c6ab28>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x1c68a48> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x1c684f0>, baseType: <0x1c0aa40>)
	<0x1c0aa40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x183d518>, file: <0x1bfad48>, line: 101, size: 256, elements: <0x1c0bb30>, identifier: "_ZTSSt18_Rb_tree_node_base")
	<0x1c0b5f8> = !DIDerivedType(tag: DW_TAG_member, name: "_M_right", scope: <0x1c0aa40>, file: <0x1bfad48>, line: 109, baseType: <0x1c0ac98>, size: 64, offset: 192)
	<0x1c0aa40> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node_base", scope: <0x183d518>, file: <0x1bfad48>, line: 101, size: 256, elements: <0x1c0bb30>, identifier: "_ZTSSt18_Rb_tree_node_base")
<0x1c68180> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x183d518>, file: <0x1b48568>, line: 208, size: 128, elements: <0x1c67dd8>, templateParams: <0x1c68280>, identifier: "_ZTSSt4pairIKiPvE")
TYCHE[32] = [32..48] = FileName: CWE843_Type_Confusion__short_74_V1b.cpp
	<0x1c684f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x183d518>, file: <0x1bfad48>, line: 216, size: 384, elements: <0x1c6c6d0>, templateParams: <0x1c6ab28>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x1c6ad88> = !DIDerivedType(tag: DW_TAG_member, name: "_M_value_field", scope: <0x1c684f0>, file: <0x1bfad48>, line: 221, baseType: <0x1c68180>, size: 128, offset: 256)
	<0x1c684f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x183d518>, file: <0x1bfad48>, line: 216, size: 384, elements: <0x1c6c6d0>, templateParams: <0x1c6ab28>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
<0x1871688> = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
TYCHE[32] = [32..36] = FileName: CWE843_Type_Confusion__short_74_V1b.cpp
	<0x1c684f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x183d518>, file: <0x1bfad48>, line: 216, size: 384, elements: <0x1c6c6d0>, templateParams: <0x1c6ab28>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x1c6ad88> = !DIDerivedType(tag: DW_TAG_member, name: "_M_value_field", scope: <0x1c684f0>, file: <0x1bfad48>, line: 221, baseType: <0x1c68180>, size: 128, offset: 256)
	<0x1c68180> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x183d518>, file: <0x1b48568>, line: 208, size: 128, elements: <0x1c67dd8>, templateParams: <0x1c68280>, identifier: "_ZTSSt4pairIKiPvE")
	<0x1c685e8> = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: <0x1c68180>, file: <0x1b48568>, line: 214, baseType: <0x1897ce8>, size: 32)
	<0x1c68180> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x183d518>, file: <0x1b48568>, line: 208, size: 128, elements: <0x1c67dd8>, templateParams: <0x1c68280>, identifier: "_ZTSSt4pairIKiPvE")
<0x1c68200> = distinct !DICompositeType(tag: DW_TAG_class_type, name: "__pair_base<const int, void *>", scope: <0x183d518>, file: <0x1b48568>, line: 190, size: 8, elements: <0x1785ba0>, templateParams: <0x1c685a0>, identifier: "_ZTSSt11__pair_baseIKiPvE")
TYCHE[32] = [32..33] = FileName: CWE843_Type_Confusion__short_74_V1b.cpp
	<0x1c684f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x183d518>, file: <0x1bfad48>, line: 216, size: 384, elements: <0x1c6c6d0>, templateParams: <0x1c6ab28>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x1c6ad88> = !DIDerivedType(tag: DW_TAG_member, name: "_M_value_field", scope: <0x1c684f0>, file: <0x1bfad48>, line: 221, baseType: <0x1c68180>, size: 128, offset: 256)
	<0x1c68180> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x183d518>, file: <0x1b48568>, line: 208, size: 128, elements: <0x1c67dd8>, templateParams: <0x1c68280>, identifier: "_ZTSSt4pairIKiPvE")
	<0x1c62d48> = !DIDerivedType(tag: DW_TAG_inheritance, scope: <0x1c68180>, baseType: <0x1c68200>, flags: DIFlagPrivate)
	<0x1c68180> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x183d518>, file: <0x1b48568>, line: 208, size: 128, elements: <0x1c67dd8>, templateParams: <0x1c68280>, identifier: "_ZTSSt4pairIKiPvE")
<0x1781828> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x18e6418>, size: 64)
TYCHE[40] = [40..48] = FileName: CWE843_Type_Confusion__short_74_V1b.cpp
	<0x1c684f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x183d518>, file: <0x1bfad48>, line: 216, size: 384, elements: <0x1c6c6d0>, templateParams: <0x1c6ab28>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x1c6ad88> = !DIDerivedType(tag: DW_TAG_member, name: "_M_value_field", scope: <0x1c684f0>, file: <0x1bfad48>, line: 221, baseType: <0x1c68180>, size: 128, offset: 256)
	<0x1c68180> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x183d518>, file: <0x1b48568>, line: 208, size: 128, elements: <0x1c67dd8>, templateParams: <0x1c68280>, identifier: "_ZTSSt4pairIKiPvE")
	<0x1c68658> = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: <0x1c68180>, file: <0x1b48568>, line: 215, baseType: <0x18e7c18>, size: 64, offset: 64)
	<0x1c68180> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x183d518>, file: <0x1b48568>, line: 208, size: 128, elements: <0x1c67dd8>, templateParams: <0x1c68280>, identifier: "_ZTSSt4pairIKiPvE")
<0x1781828> = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: <0x18e6418>, size: 64)
TYCHE[40] = [40..48] = FileName: CWE843_Type_Confusion__short_74_V1b.cpp
	<0x1c684f0> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_Rb_tree_node<std::pair<const int, void *> >", scope: <0x183d518>, file: <0x1bfad48>, line: 216, size: 384, elements: <0x1c6c6d0>, templateParams: <0x1c6ab28>, identifier: "_ZTSSt13_Rb_tree_nodeISt4pairIKiPvEE")
	<0x1c6ad88> = !DIDerivedType(tag: DW_TAG_member, name: "_M_value_field", scope: <0x1c684f0>, file: <0x1bfad48>, line: 221, baseType: <0x1c68180>, size: 128, offset: 256)
	<0x1c68180> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x183d518>, file: <0x1b48568>, line: 208, size: 128, elements: <0x1c67dd8>, templateParams: <0x1c68280>, identifier: "_ZTSSt4pairIKiPvE")
	<0x1c68658> = !DIDerivedType(tag: DW_TAG_member, name: "second", scope: <0x1c68180>, file: <0x1b48568>, line: 215, baseType: <0x18e7c18>, size: 64, offset: 64)
	<0x1c68180> = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pair<const int, void *>", scope: <0x183d518>, file: <0x1b48568>, line: 208, size: 128, elements: <0x1c67dd8>, templateParams: <0x1c68280>, identifier: "_ZTSSt4pairIKiPvE")
CWE843_Type_Confusion__short_74_V1b.cpp#111_27##139979541952874#0
AllocationPointsDIInfo[30444376] Size: 15
--------------------------------------------------------------------------------------------------------------
